phy_test/RadonDB_test_result/test_adjust_args/oltp_insert_32_448.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 448
Report intermediate results every 3 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 3s ] thds: 448 tps: 76896.75 qps: 76896.75 (r/w/o: 0.00/76896.75/0.00) lat (ms,95%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 448 tps: 93480.98 qps: 93480.98 (r/w/o: 0.00/93480.98/0.00) lat (ms,95%): 11.45 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 448 tps: 97058.88 qps: 97058.88 (r/w/o: 0.00/97058.88/0.00) lat (ms,95%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 448 tps: 61387.96 qps: 61388.29 (r/w/o: 0.00/61388.29/0.00) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 448 tps: 65471.56 qps: 65471.23 (r/w/o: 0.00/65471.23/0.00) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 448 tps: 62075.84 qps: 62075.84 (r/w/o: 0.00/62075.84/0.00) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 448 tps: 60971.23 qps: 60971.56 (r/w/o: 0.00/60971.56/0.00) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 448 tps: 39186.35 qps: 39186.02 (r/w/o: 0.00/39186.02/0.00) lat (ms,95%): 29.72 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 448 tps: 28556.49 qps: 28556.49 (r/w/o: 0.00/28556.49/0.00) lat (ms,95%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 448 tps: 29160.77 qps: 29160.77 (r/w/o: 0.00/29160.77/0.00) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           1843802
        other:                           0
        total:                           1843802
    transactions:                        1843802 (61284.96 per sec.)
    queries:                             1843802 (61284.96 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.0827s
    total number of events:              1843802

Latency (ms):
         min:                                  0.65
         avg:                                  7.29
         max:                                289.36
         95th percentile:                     21.50
         sum:                            13443365.11

Threads fairness:
    events (avg/stddev):           4115.6295/51.73
    execution time (avg/stddev):   30.0075/0.01