phy_test/RadonDB_test_result/test_adjust_args/oltp_insert_32_512.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 512
Report intermediate results every 3 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 3s ] thds: 512 tps: 84610.74 qps: 84612.08 (r/w/o: 0.00/84612.08/0.00) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 512 tps: 93126.29 qps: 93125.29 (r/w/o: 0.00/93125.29/0.00) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 512 tps: 89291.11 qps: 89290.78 (r/w/o: 0.00/89290.78/0.00) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 512 tps: 66875.16 qps: 66875.16 (r/w/o: 0.00/66875.16/0.00) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 512 tps: 70948.54 qps: 70948.54 (r/w/o: 0.00/70948.54/0.00) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 512 tps: 61140.57 qps: 61140.57 (r/w/o: 0.00/61140.57/0.00) lat (ms,95%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 512 tps: 64019.30 qps: 64019.30 (r/w/o: 0.00/64019.30/0.00) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 512 tps: 32629.29 qps: 32629.29 (r/w/o: 0.00/32629.29/0.00) lat (ms,95%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 512 tps: 26286.83 qps: 26286.83 (r/w/o: 0.00/26286.83/0.00) lat (ms,95%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 512 tps: 31755.49 qps: 31755.82 (r/w/o: 0.00/31755.82/0.00) lat (ms,95%): 42.61 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           1862908
        other:                           0
        total:                           1862908
    transactions:                        1862908 (61882.69 per sec.)
    queries:                             1862908 (61882.69 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.1011s
    total number of events:              1862908

Latency (ms):
         min:                                  0.65
         avg:                                  8.25
         max:                                346.04
         95th percentile:                     23.95
         sum:                            15363217.17

Threads fairness:
    events (avg/stddev):           3638.4922/50.70
    execution time (avg/stddev):   30.0063/0.02