phy_test/RadonDB_test_result/test_adjust_args/oltp_insert_32_640.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 640
Report intermediate results every 3 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 3s ] thds: 640 tps: 91248.84 qps: 91248.84 (r/w/o: 0.00/91248.84/0.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 640 tps: 88455.98 qps: 88455.98 (r/w/o: 0.00/88455.98/0.00) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 640 tps: 105086.29 qps: 105086.29 (r/w/o: 0.00/105086.29/0.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 640 tps: 58978.23 qps: 58978.23 (r/w/o: 0.00/58978.23/0.00) lat (ms,95%): 28.67 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 640 tps: 82709.85 qps: 82709.85 (r/w/o: 0.00/82709.85/0.00) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 640 tps: 54010.88 qps: 54010.88 (r/w/o: 0.00/54010.88/0.00) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 640 tps: 61311.94 qps: 61311.94 (r/w/o: 0.00/61311.94/0.00) lat (ms,95%): 27.17 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 640 tps: 29910.90 qps: 29910.90 (r/w/o: 0.00/29910.90/0.00) lat (ms,95%): 58.92 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 640 tps: 25242.23 qps: 25242.23 (r/w/o: 0.00/25242.23/0.00) lat (ms,95%): 69.29 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 640 tps: 36693.72 qps: 36693.72 (r/w/o: 0.00/36693.72/0.00) lat (ms,95%): 42.61 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           1902573
        other:                           0
        total:                           1902573
    transactions:                        1902573 (63181.47 per sec.)
    queries:                             1902573 (63181.47 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.1086s
    total number of events:              1902573

Latency (ms):
         min:                                  0.64
         avg:                                 10.09
         max:                                476.58
         95th percentile:                     29.19
         sum:                            19204593.38

Threads fairness:
    events (avg/stddev):           2972.7703/45.80
    execution time (avg/stddev):   30.0072/0.01