phy_test/RadonDB_test_result/test_adjust_args/oltp_insert_32_896.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 896
Report intermediate results every 3 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 3s ] thds: 896 tps: 94736.76 qps: 94736.76 (r/w/o: 0.00/94736.76/0.00) lat (ms,95%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 896 tps: 88313.49 qps: 88313.49 (r/w/o: 0.00/88313.49/0.00) lat (ms,95%): 24.38 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 896 tps: 99317.09 qps: 99317.09 (r/w/o: 0.00/99317.09/0.00) lat (ms,95%): 26.20 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 896 tps: 35612.99 qps: 35613.32 (r/w/o: 0.00/35613.32/0.00) lat (ms,95%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 896 tps: 78368.11 qps: 78367.45 (r/w/o: 0.00/78367.45/0.00) lat (ms,95%): 27.17 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 896 tps: 53036.74 qps: 53037.07 (r/w/o: 0.00/53037.07/0.00) lat (ms,95%): 61.08 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 896 tps: 49856.10 qps: 49856.43 (r/w/o: 0.00/49856.43/0.00) lat (ms,95%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 896 tps: 52018.54 qps: 52018.21 (r/w/o: 0.00/52018.21/0.00) lat (ms,95%): 42.61 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 896 tps: 29017.23 qps: 29017.23 (r/w/o: 0.00/29017.23/0.00) lat (ms,95%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 896 tps: 4976.16 qps: 4976.16 (r/w/o: 0.00/4976.16/0.00) lat (ms,95%): 227.40 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           1756901
        other:                           0
        total:                           1756901
    transactions:                        1756901 (57455.25 per sec.)
    queries:                             1756901 (57455.25 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.5757s
    total number of events:              1756901

Latency (ms):
         min:                                  0.63
         avg:                                 15.53
         max:                               3231.12
         95th percentile:                     36.89
         sum:                            27277951.02

Threads fairness:
    events (avg/stddev):           1960.8270/44.01
    execution time (avg/stddev):   30.4441/0.02